#include "../include/ClassicML.h"

template <int R, int C>
double** copy_static_memory(double(&matrix)[R][C])
{
	double** dest = new double* [R];
	for (int i = 0; i < R; i++)
	{
		dest[i] = new double[C];
	}
	for (int i = 0; i < R; i++)
	{
		for (int j = 0; j < C; j++)
		{
			dest[i][j] = matrix[i][j];
		}
	}
	return dest;
}

static void free_memory_(double** matrix, int rows)
{
	for (int i = 0; i < rows; i++)
	{
		delete[] matrix[i];
	}
	delete[] matrix;
	matrix = nullptr;
}

int main()
{
	int train_rows_x = 40;
	int train_cols_x = 4;  // [часы_учёбы, часы_сна, посещаемость, сложность_предмета]
	double xx[][4] = {
		// Не сдали (класс 0)
		{5.0, 4.0, 60.0, 8.0},   // мало учится, мало спит, низкая посещаемость
		{6.0, 5.0, 65.0, 7.0},   {4.0, 6.0, 55.0, 9.0},   {7.0, 4.0, 70.0, 8.0},
		{5.0, 5.0, 58.0, 7.0},   {6.0, 4.0, 62.0, 8.0},   {4.0, 5.0, 53.0, 9.0},
		{5.0, 6.0, 67.0, 6.0},   {7.0, 3.0, 59.0, 8.0},   {6.0, 5.0, 64.0, 7.0},
		{4.0, 4.0, 51.0, 9.0},   {5.0, 5.0, 66.0, 6.0},   {6.0, 4.0, 57.0, 8.0},
		{7.0, 5.0, 68.0, 5.0},   {5.0, 3.0, 54.0, 9.0},   {4.0, 6.0, 69.0, 4.0},
		{6.0, 4.0, 56.0, 8.0},   {5.0, 5.0, 63.0, 7.0},   {7.0, 6.0, 71.0, 3.0},
		{4.0, 4.0, 52.0, 9.0},

		// Сдали (класс 1)
		{12.0, 7.0, 85.0, 3.0},  // много учится, хорошо спит, высокая посещаемость
		{15.0, 8.0, 90.0, 2.0},  {10.0, 7.0, 82.0, 4.0},  {14.0, 8.0, 88.0, 3.0},
		{13.0, 7.0, 84.0, 4.0},  {11.0, 8.0, 87.0, 3.0},  {16.0, 7.0, 92.0, 2.0},
		{12.0, 9.0, 83.0, 4.0},  {14.0, 7.0, 89.0, 3.0},  {15.0, 8.0, 91.0, 2.0},
		{10.0, 8.0, 81.0, 5.0},  {13.0, 7.0, 86.0, 3.0},  {11.0, 9.0, 84.0, 4.0},
		{16.0, 8.0, 93.0, 1.0},  {12.0, 7.0, 85.0, 4.0},  {14.0, 8.0, 88.0, 3.0},
		{15.0, 7.0, 90.0, 2.0},  {13.0, 8.0, 87.0, 3.0},  {11.0, 7.0, 82.0, 5.0},
		{16.0, 9.0, 94.0, 1.0}
	};

	int train_rows_y = 40;
	int train_cols_y = 1;  // ОДНА колонка: 0 = не сдал, 1 = сдал
	double yy[][1] = {
		{0.0}, {0.0}, {0.0}, {0.0}, {0.0}, {0.0}, {0.0}, {0.0}, {0.0}, {0.0},
		{0.0}, {0.0}, {0.0}, {0.0}, {0.0}, {0.0}, {0.0}, {0.0}, {0.0}, {0.0},
		{1.0}, {1.0}, {1.0}, {1.0}, {1.0}, {1.0}, {1.0}, {1.0}, {1.0}, {1.0},
		{1.0}, {1.0}, {1.0}, {1.0}, {1.0}, {1.0}, {1.0}, {1.0}, {1.0}, {1.0}
	};

	double** x = copy_static_memory(xx);
	double** y = copy_static_memory(yy);

	Matrix X(x, train_rows_x, train_cols_x, "X");
	Matrix Y(y, train_rows_y, train_cols_y, "Y");

	// Предобработка
	Dataset data(X, Y);
	StandartScaler scaler(data);
	scaler.split();
    scaler.standartNormalize();

	// Создаем и обучаем модель
	LogisticRegression model(data);
	model.train("sgd", 0, 0.1, 8);
	data.Y_test.print();
	model.predict().print();
	model.loss();


	free_memory_(x, train_rows_x);
	free_memory_(y, train_rows_y);

	return 0;
}